[
  {"description":"Pediste ajuda quando não sabias o que fazer? Avança duas casas. Vulnerabilidade é inteligência.","forwardSteps":2,"backwardSteps":0},
  {"description":"Aproveitaste uma crítica construtiva para melhorar? Avança uma casa. Crescimento vem da escuta.","forwardSteps":1,"backwardSteps":0},
  {"description":"Fingiste que sabias só para parecer competente. Recua uma casa. Orgulho atrasa aprendizagem.","forwardSteps":0,"backwardSteps":1},
  {"description":"Ficaste preso à ideia de que tens de ser perfeito? Recua uma casa. O medo de falhar também bloqueia o sucesso.","forwardSteps":0,"backwardSteps":1},
  {"description":"Adiaste um projeto importante por medo de julgamento? Recua uma casa. O tempo perdido não volta.","forwardSteps":0,"backwardSteps":1},
  {"description":"Aceitaste feedback sem levar para o lado pessoal. Avança duas casas. Maturidade abre portas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Acreditaste que não eras bom o suficiente e não tentaste? Mantém a posição. A autossabotagem é um inimigo invisível.","forwardSteps":0,"backwardSteps":0},
  {"description":"Celebraste uma pequena vitória em vez de te autoexigires? Avança uma casa. Reconhecer conquistas alimenta o progresso.","forwardSteps":1,"backwardSteps":0},
  {"description":"Disseste sim a tudo e ficaste exausto? Recua duas casas. Sem limites, o sucesso vira desgaste.","forwardSteps":0,"backwardSteps":2},
  {"description":"Disseste não a algo que não alinhava com os teus valores? Avança uma casa. Integridade também é sucesso.","forwardSteps":1,"backwardSteps":0},
  {"description":"Comparaste-te constantemente com os outros? Recua uma casa. A régua do outro não é a tua.","forwardSteps":0,"backwardSteps":1},
  {"description":"Criaste uma rotina que respeita o teu ritmo? Avança uma casa. Disciplina com leveza funciona.","forwardSteps":1,"backwardSteps":0},
  {"description":"Ficaste preso ao passado em vez de te adaptares ao presente? Recua uma casa. Resistência à mudança bloqueia avanço.","forwardSteps":0,"backwardSteps":1},
  {"description":"Usaste os teus recursos para te reinventares? Avança duas casas. Criatividade alavanca.","forwardSteps":2,"backwardSteps":0},
  {"description":"Culpaste-te por tudo o que não controlas? Recua uma casa. Autocompaixão também impulsiona.","forwardSteps":0,"backwardSteps":1},
  {"description":"Arriscaste sem ter garantias? Avança duas casas. Coragem move o jogo.","forwardSteps":2,"backwardSteps":0},
  {"description":"Ignoraste sinais de burnout e continuaste no automático? Recua duas casas. Sucesso sem saúde não se sustenta.","forwardSteps":0,"backwardSteps":2},
  {"description":"Rodeaste-te de pessoas que te apoiam? Avança duas casas. Sucesso também é coletivo.","forwardSteps":2,"backwardSteps":0},
  {"description":"Guardaste boas ideias por medo de parecer ridículo? Recua uma casa. Quem cala, perde palco.","forwardSteps":0,"backwardSteps":1},
  {"description":"Disseste o que pensavas com respeito e assertividade? Avança uma casa. A clareza abre caminhos.","forwardSteps":1,"backwardSteps":0},
  {"description":"Deixaste que o cansaço decidisse por ti? Recua duas casas. Nem sempre parar é retroceder, mas fugir é.","forwardSteps":0,"backwardSteps":2},
  {"description":"Aceitaste errar como parte do processo? Avança duas casas. Quem erra aprende, quem aprende avança.","forwardSteps":2,"backwardSteps":0},
  {"description":"Fizeste o mínimo possível para não dar nas vistas? Recua uma casa. A invisibilidade cobra o seu preço.","forwardSteps":0,"backwardSteps":1},
  {"description":"Ouviste alguém sem interromper? Avança uma casa. Quem escuta entende mais.","forwardSteps":1,"backwardSteps":0},
  {"description":"Ignoraste uma oportunidade por medo de fracassar? Recua duas casas. O medo protege, mas paralisa.","forwardSteps":0,"backwardSteps":2},
  {"description":"Leste, aprendeste e aplicaste algo novo? Avança duas casas. O conhecimento transforma trajetórias.","forwardSteps":2,"backwardSteps":0},
  {"description":"Culpaste sempre os outros pelos teus insucessos? Recua duas casas. A responsabilização é o primeiro passo para a mudança.","forwardSteps":0,"backwardSteps":2},
  {"description":"Planeaste antes de agir, mesmo com ansiedade? Avança duas casas. A organização é energia bem canalizada.","forwardSteps":2,"backwardSteps":0},
  {"description":"Foste consistente mesmo quando não estavas motivado? Avança três casas. Disciplina constrói futuros.","forwardSteps":3,"backwardSteps":0},
  {"description":"Escolheste atalhos que não condizem com os teus valores? Recua duas casas. Nem tudo que é rápido leva longe.","forwardSteps":0,"backwardSteps":2},
  {"description":"Quiseste agradar a todos e esqueceste de ti? Recua uma casa. A procura por validação é um labirinto.","forwardSteps":0,"backwardSteps":1},
  {"description":"Criticaste alguém só para te sentires melhor? Recua uma casa. O sucesso alheio não é ameaça.","forwardSteps":0,"backwardSteps":1},
  {"description":"Deixaste que um erro definisse a tua identidade? Recua uma casa. És mais do que as tuas falhas.","forwardSteps":0,"backwardSteps":1},
  {"description":"Ignoraste uma oportunidade por medo de fracassar? Recua duas casas. O medo protege, mas paralisa.","forwardSteps":0,"backwardSteps":2},
  {"description":"Pediste desculpa sem tentar justificar? Avança uma casa. Humildade aproxima.","forwardSteps":1,"backwardSteps":0},
  {"description":"Dormiste bem e respeitaste os teus limites? Avança uma casa. O corpo também é ferramenta de sucesso.","forwardSteps":1,"backwardSteps":0},
  {"description":"Apostaste no multitasking e não terminaste nada? Recua uma casa. Foco é mais eficiente do que pressa.","forwardSteps":0,"backwardSteps":1},
  {"description":"Foste consistente mesmo quando não estavas motivado? Avança três casas. Disciplina constrói futuros.","forwardSteps":3,"backwardSteps":0},
  {"description":"Escolheste atalhos que não condizem com os teus valores? Recua duas casas. Nem tudo que é rápido leva longe.","forwardSteps":0,"backwardSteps":2},
  {"description":"Celebraste o sucesso de outra pessoa? Avança duas casas. Apoiar o outro não te diminui, te eleva.","forwardSteps":2,"backwardSteps":0},
  {"description":"Disseste não para proteger os teus limites? Avança duas casas. Dizer não também é autocuidado.","forwardSteps":2,"backwardSteps":0},
  {"description":"Guardaste ressentimento em vez de dialogar? Recua uma casa. Silêncio nem sempre é paz.","forwardSteps":0,"backwardSteps":1},
  {"description":"Mentiste para evitar um conflito? Recua uma casa. O silêncio nem sempre é paz.","forwardSteps":0,"backwardSteps":1},
  {"description":"Evitaste pedir ajuda por orgulho? Recua duas casas. Ninguém cresce sozinho.","forwardSteps":0,"backwardSteps":2},
  {"description":"Fingiste que tudo estava bem para evitar conflitos? Recua duas casas. A autenticidade custa, mas liberta.","forwardSteps":0,"backwardSteps":2},
  {"description":"Ignoraste sinais do teu corpo? Recua uma casa. O corpo fala antes da mente gritar.","forwardSteps":0,"backwardSteps":1},
  {"description":"Escolheste agradar aos outros em vez de seres verdadeiro? Recua uma casa. Agrado não substitui autenticidade.","forwardSteps":0,"backwardSteps":1},
  {"description":"Apostaste no perfeccionismo e não começaste? Recua uma casa. A ação imperfeita vale mais que a inércia perfeita.","forwardSteps":0,"backwardSteps":1},
  {"description":"Disfarçaste inseguranças com arrogância? Recua uma casa. Vulnerabilidade não é fraqueza.","forwardSteps":0,"backwardSteps":1},
  {"description":"Agradeceste a ti mesmo por continuares a tentar? Avança uma casa. Autorreconhecimento nutre a motivação.","forwardSteps":1,"backwardSteps":0},
  {"description":"Abriste mão de um hábito que te fazia mal? Avança duas casas. Soltar também é crescer.","forwardSteps":2,"backwardSteps":0},
  {"description":"Ignoraste o telemóvel para dar mais atenção à pessoa com quem estás? Avança uma casa. Atenção plena é presença real.","forwardSteps":1,"backwardSteps":0},
  {"description":"Trabalhaste tanto que esqueceste de viver? Recua duas casas. O sucesso sem equilíbrio é derrota disfarçada.","forwardSteps":0,"backwardSteps":2},
  {"description":"Desvalorizaste uma conquista por não parecer grande? Recua uma casa. Desprezar o que é teu enfraquece-te.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fizeste algo difícil mesmo com medo? Avança duas casas. Coragem não é ausência de medo — é avançar apesar dele.","forwardSteps":2,"backwardSteps":0},
  {"description":"Persististe mesmo quando ninguém acreditava? Avança duas casas. A consistência é o teu superpoder.","forwardSteps":2,"backwardSteps":0},
  {"description":"Foste gentil com alguém que te tratou com frieza? Avança uma casa. A tua resposta reflete quem tu és.","forwardSteps":1,"backwardSteps":0},
  {"description":"Escolheste calar quando devias ter-te defendido? Recua uma casa. Silenciar-se constantemente apaga a identidade.","forwardSteps":0,"backwardSteps":1},
  {"description":"Mostraste vulnerabilidade num momento difícil? Avança uma casa. Ser verdadeiro é mais forte do que parecer forte.","forwardSteps":1,"backwardSteps":0},
  {"description":"Usaste o humor para evitar uma conversa séria? Recua uma casa. Fugir com piadas não resolve o que dói.","forwardSteps":0,"backwardSteps":1},
  {"description":"Puseste as emoções dos outros à frente das tuas? Recua uma casa. Cuidar de ti não é egoísmo.","forwardSteps":0,"backwardSteps":1},
  {"description":"Criticaste os outros por coisas que também fazes? Recua uma casa. A coerência começa em casa.","forwardSteps":0,"backwardSteps":1},
  {"description":"Revisaste as tuas próprias ideias com mente aberta? Avança duas casas. A flexibilidade mental é sinal de maturidade.","forwardSteps":2,"backwardSteps":0},
  {"description":"Tomaste o crédito por algo que não fizeste? Recua duas casas. A honestidade é o verdadeiro reconhecimento.","forwardSteps":0,"backwardSteps":2},
  {"description":"Ignoraste as tuas emoções para não parecer fraco? Recua uma casa. A vulnerabilidade constrói pontes.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fingiste estar tudo bem só para manter a paz? Recua uma casa. Paz forçada gera guerra interna.","forwardSteps":0,"backwardSteps":1},
  {"description":"Mentiste no currículo ou exageraste nas tuas conquistas? Recua uma casa. O sucesso forçado desaba depressa.","forwardSteps":0,"backwardSteps":1},
  {"description":"Criticaste o teu companheiro/a em público? Recua uma casa. As feridas expostas cicatrizam mal.","forwardSteps":0,"backwardSteps":1},
  {"description":"Comparaste o teu companheiro/a com alguém do passado? Recua duas casas. O passado não deve pesar no presente.","forwardSteps":0,"backwardSteps":2},
  {"description":"Fizeste chantagem emocional para conseguires o que querias? Recua duas casas. Manipular não é amar.","forwardSteps":0,"backwardSteps":2},
  {"description":"Pediste desculpa sem justificações? Avança uma casa. Pedir desculpa é mais forte do que parece.","forwardSteps":1,"backwardSteps":0},
  {"description":"Apoiaste emocionalmente o teu companheiro/a sem tentar 'consertá‑lo'? Avança uma casa. Às vezes, só estar lá basta.","forwardSteps":1,"backwardSteps":0},
  {"description":"Guardaste rancor em vez de procurar reconciliação? Recua duas casas. O rancor aprisiona mais quem o carrega.","forwardSteps":0,"backwardSteps":2},
  {"description":"Tiveste coragem de pedir perdão a alguém que magoaste? Avança duas casas. A reconexão começa na humildade.","forwardSteps":2,"backwardSteps":0},
  {"description":"Passaste por cima de alguém para alcançar um objetivo? Recua duas casas. O sucesso que fere não é sucesso.","forwardSteps":0,"backwardSteps":2},
  {"description":"Mantiveste-te fiel aos teus princípios mesmo sob pressão? Avança três casas. Coerência tem um preço alto, mas vale mais.","forwardSteps":3,"backwardSteps":0},
  {"description":"Tiveste coragem de pedir perdão a alguém que magoaste? Avança duas casas. A reconexão começa na humildade.","forwardSteps":2,"backwardSteps":0},
  {"description":"Reconheceste o mérito de quem te ajudou a chegar onde estás? Avança uma casa. Gratidão é a base da grandeza.","forwardSteps":1,"backwardSteps":0},
  {"description":"Falaste de alguém nas costas com julgamento? Recua uma casa. O que se diz nas sombras define o caráter.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fizeste algo só porque toda a gente faz? Recua uma casa. As multidões nem sempre apontam para o certo.","forwardSteps":0,"backwardSteps":1},
  {"description":"Usaste o teu talento para inspirar outros? Avança duas casas. Sucesso partilhado é multiplicado.","forwardSteps":2,"backwardSteps":0},
  {"description":"Invadiste a privacidade do teu companheiro/a por ciúmes? O amor saudável não vigia — confia.","forwardSteps":0,"backwardSteps":1},
  {"description":"Falaste mal do teu companheiro/a a amigos ou família? O respeito é também na tua ausência.","forwardSteps":0,"backwardSteps":2},
  {"description":"Assumiste um compromisso sem estar preparado para ele? Prometer sem poder cumprir mina a confiança.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fizeste algo bom pelo teu companheiro/a sem esperar reconhecimento? Amor não se mede por aplausos.","forwardSteps":1,"backwardSteps":0},
  {"description":"Reconheceste os teus próprios privilégios sem te sentires atacado? Consciência é o início da mudança.","forwardSteps":1,"backwardSteps":0},
  {"description":"Criticaste publicamente para te sentires superior? Humilhar não é vencer.","forwardSteps":0,"backwardSteps":2},
  {"description":"Partilhaste uma mentira sem verificar os factos? A desinformação espalha-se depressa, mas cobra caro.","forwardSteps":0,"backwardSteps":2},
  {"description":"Ignoraste um erro teu e culpaste os outros? Fugir da responsabilidade atrasa o crescimento.","forwardSteps":0,"backwardSteps":2},
  {"description":"Deste prioridade à tua saúde mental num dia difícil? Cuidar da mente é sustentar o resto.","forwardSteps":1,"backwardSteps":0},
  {"description":"Estudaste com regularidade mesmo sem um teste à vista? A consistência vence a pressa de última hora.","forwardSteps":1,"backwardSteps":0},
  {"description":"Deixaste um trabalho por fazer porque “o professor não liga”? O teu esforço é sobre ti, não sobre ele.","forwardSteps":0,"backwardSteps":1},
  {"description":"Inventaste uma desculpa para não entregar um trabalho? A honestidade também se treina na escola.","forwardSteps":0,"backwardSteps":1},
  {"description":"Copiaste no teste em vez de confiares no que sabias? O atalho hoje rouba-te o futuro amanhã.","forwardSteps":0,"backwardSteps":1},
  {"description":"Organizaste o teu tempo para estudar e descansar? Equilíbrio é produtividade inteligente.","forwardSteps":1,"backwardSteps":0},
  {"description":"Aproveitaste bem o tempo dentro da sala de aula? Presença não é só física.","forwardSteps":1,"backwardSteps":0},
  {"description":"Fizeste perguntas quando não compreendeste a matéria? Quem pergunta cresce.","forwardSteps":1,"backwardSteps":0},
  {"description":"Riste de alguém que teve uma dúvida em aula? O desrespeito bloqueia a aprendizagem.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fizeste de tudo para ter boa nota, mesmo prejudicando colegas? O valor da conquista está em como chegas lá.","forwardSteps":0,"backwardSteps":2},
  {"description":"Pediste ajuda quando estavas perdido num conteúdo? Ninguém aprende sozinho.","forwardSteps":1,"backwardSteps":0},
  {"description":"Faltaste às aulas por desmotivação, sem tentar entender porquê? A fuga esconde problemas que voltam.","forwardSteps":0,"backwardSteps":1},
  {"description":"Criticaste um professor pelas costas em vez de dialogar? Comunicação honesta constrói mais que queixas.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fingiste que compreendias só para parecer bem? Fingir saber não leva à aprendizagem.","forwardSteps":0,"backwardSteps":1},
  {"description":"Conseguiste estudar sem depender do telemóvel a cada 5 minutos? Foco é uma superpotência.","forwardSteps":1,"backwardSteps":0},
  {"description":"Leste mais do que o mínimo exigido? A curiosidade expande horizontes.","forwardSteps":1,"backwardSteps":0},
  {"description":"Ajudaste um colega com dificuldade sem esperar nada em troca? Solidariedade também é sucesso.","forwardSteps":1,"backwardSteps":0},
  {"description":"Tiveste coragem de dizer que estavas sobrecarregado? Reconhecer limites é maturidade.","forwardSteps":1,"backwardSteps":0},
  {"description":"Escolheste copiar um trabalho da internet em vez de fazer o teu? Aprender exige autoria.","forwardSteps":0,"backwardSteps":2},
  {"description":"Celebraste uma boa nota sem desvalorizar quem teve menos? Humildade também é inteligência.","forwardSteps":1,"backwardSteps":0},
  {"description":"Revisaste o teste antes de entregar, com atenção? O cuidado também conta.","forwardSteps":1,"backwardSteps":0},
  {"description":"Apostaste tudo na sorte em vez de estudar com método? Contar com a sorte não é estratégia.","forwardSteps":0,"backwardSteps":1},
  {"description":"Preparaste-te para uma apresentação mesmo tendo medo de falar em público? Coragem é treino, não dom.","forwardSteps":1,"backwardSteps":0},
  {"description":"Roubaste ideias de alguém num trabalho de grupo sem dar crédito? O mérito partilhado vale mais.","forwardSteps":0,"backwardSteps":2},
  {"description":"Estudaste para aprender, e não só para a nota? O que ficas a saber vale mais que o número.","forwardSteps":1,"backwardSteps":0},
  {"description":"Desististe de estudar uma disciplina só porque “não gostas do professor”? Quem perde és tu, não ele.","forwardSteps":0,"backwardSteps":1},
  {"description":"Admitiste quando não fizeste um trabalho em vez de inventar uma desculpa? Honestidade gera respeito.","forwardSteps":1,"backwardSteps":0},
  {"description":"Falaste com o professor sobre dificuldades em vez de guardar tudo para ti? Procurar apoio é sinal de inteligência.","forwardSteps":1,"backwardSteps":0},
  {"description":"Sabotaste o trabalho de um colega por competição? Competir sem ética destrói mais do que constrói.","forwardSteps":0,"backwardSteps":2},
  {"description":"Foste solidário com um colega nervoso antes de um teste? Um gesto de empatia pode mudar um dia.","forwardSteps":1,"backwardSteps":0},
  {"description":"Lidaste com uma má nota sem culpar o mundo? Responsabilidade é crescimento.","forwardSteps":1,"backwardSteps":0},
  {"description":"Fizeste os teus apontamentos ao longo das aulas? Pequenos hábitos criam grandes resultados.","forwardSteps":1,"backwardSteps":0},
  {"description":"Ignoraste um conteúdo porque “não vai sair no teste”? Aprender não é só para passar.","forwardSteps":0,"backwardSteps":1},
  {"description":"Espalhaste boatos sobre alguém da turma? O ambiente escolar é responsabilidade de todos.","forwardSteps":0,"backwardSteps":1},
  {"description":"Ficaste a estudar até muito tarde no dia anterior ao teste? O cansaço também cobra o seu preço.","forwardSteps":0,"backwardSteps":1},
  {"description":"Geriste bem o tempo entre estudo, descanso e lazer? Equilíbrio é mais produtivo que obsessão.","forwardSteps":1,"backwardSteps":0},
  {"description":"Fizeste algo que sabias que podia prejudicar o coletivo da turma? Escolhas individuais têm impacto comum.","forwardSteps":0,"backwardSteps":2},
  {"description":"Planeaste a tua semana de estudo com antecedência? Organização é meio caminho.","forwardSteps":1,"backwardSteps":0},
  {"description":"Entregaste um trabalho dentro do prazo, mesmo com vontade de desistir? A persistência é mais forte do que a motivação.","forwardSteps":1,"backwardSteps":0},
  {"description":"Ficaste calado quando sabias que alguém estava a ser injustiçado? A omissão também tem peso.","forwardSteps":0,"backwardSteps":1},
  {"description":"Ficaste em silêncio numa aula que sabias que podia beneficiar de uma pergunta tua? Participar é contribuir.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fizeste barulho numa aula só porque outros também faziam? O que banalizas hoje pode fazer-te falta amanhã.","forwardSteps":0,"backwardSteps":1},
  {"description":"Leste por curiosidade, mesmo não sendo matéria da aula? Conhecimento sem obrigação vale ainda mais.","forwardSteps":1,"backwardSteps":0},
  {"description":"Desligaste o telemóvel por ti mesmo para conseguires estudar? Dominar o foco é dominar o futuro.","forwardSteps":1,"backwardSteps":0},
  {"description":"Riste de ti mesmo quando erraste em vez de te esconderes? Aprender também é rir dos tropeços.","forwardSteps":1,"backwardSteps":0},
  {"description":"Procrastinaste uma tarefa até ao último momento, sem razão válida? O tempo não volta.","forwardSteps":0,"backwardSteps":1},
  {"description":"Refletiste sobre o que correu mal num teste? Errar com consciência é aprender a dobrar.","forwardSteps":1,"backwardSteps":0},
  {"description":"Tiraste tempo para respirar e descansar antes de um teste difícil? O cérebro também precisa de pausa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Trabalhaste para melhorar numa disciplina que te custa mais? Dificuldade não é destino.","forwardSteps":1,"backwardSteps":0},
  {"description":"Deixaste os outros fazerem todo o trabalho num trabalho de grupo? O grupo não serve para te esconder.","forwardSteps":0,"backwardSteps":2},
  {"description":"Mentiste a um professor sobre o motivo de uma falta? A verdade custa menos do que parece.","forwardSteps":0,"backwardSteps":1},
  {"description":"Interrompeste várias vezes uma aula com comentários fora de contexto? Quem não ouve, não aprende.","forwardSteps":0,"backwardSteps":1},
  {"description":"Comparaste-te negativamente com colegas em vez de focares no teu caminho? A comparação rouba energia.","forwardSteps":0,"backwardSteps":1},
  {"description":"Ficaste a estudar por pressão dos outros e não por ti? A motivação externa tem prazo curto.","forwardSteps":0,"backwardSteps":1},
  {"description":"Deste o teu melhor mesmo quando não era um “teste importante”? A excelência nasce no hábito.","forwardSteps":1,"backwardSteps":0},
  {"description":"Trabalhaste mais a imagem do que o conteúdo num trabalho? O que parece bom nem sempre é o que ensina.","forwardSteps":0,"backwardSteps":1},
  {"description":"Ajudaste um colega com dificuldades sem te sentires “superior”? Humildade e solidariedade caminham juntas.","forwardSteps":1,"backwardSteps":0},
  {"description":"Criticaste alguém que estava motivado para estudar? Desmotivar os outros não te eleva.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fizeste parte de uma conversa que goza com um professor? O respeito não é opcional.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fizeste batota num jogo educativo da turma? O que ganhas na mentira, perdes em caráter.","forwardSteps":0,"backwardSteps":1},
  {"description":"Criaste uma rotina de estudo personalizada ao teu ritmo? Conhecer-te melhora os resultados.","forwardSteps":1,"backwardSteps":0},
  {"description":"Lidaste com a frustração de uma má nota sem desistir? Quem não desiste, cresce.","forwardSteps":1,"backwardSteps":0},
  {"description":"Assumiste um erro teu antes que alguém o descobrisse? A responsabilidade pessoal inspira confiança.","forwardSteps":1,"backwardSteps":0},
  {"description":"Usaste desculpas para justificar preguiça? A sinceridade contigo mesmo é o primeiro passo.","forwardSteps":0,"backwardSteps":1},
  {"description":"Admitiste quando não estavas mentalmente bem para estudar? Reconhecer limites é maturidade.","forwardSteps":1,"backwardSteps":0},
  {"description":"Explicaste uma matéria a alguém, mesmo sem seres “dos melhores”? Ensinar é outra forma de aprender.","forwardSteps":1,"backwardSteps":0},
  {"description":"Participaste ativamente numa aula mesmo com receio de errar? O erro é parte do caminho.","forwardSteps":1,"backwardSteps":0},
  {"description":"Interrompeste colegas durante uma apresentação só para fazer piada? Desrespeitar o esforço dos outros empobrece o teu.","forwardSteps":0,"backwardSteps":1},
  {"description":"Ignoraste uma oportunidade de recuperação ou melhoria? As segundas oportunidades são para agarrar.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fizeste uma tarefa “só para despachar”? O esforço que poupas hoje faz-te falta amanhã.","forwardSteps":0,"backwardSteps":1},
  {"description":"Desististe de estudar uma disciplina só porque diziam que “não serve para nada”? O que aprendes hoje pode surpreender-te amanhã.","forwardSteps":0,"backwardSteps":1},
  {"description":"Ficaste acordado até tarde em redes sociais antes de um teste? O sono perdido cobra-se em atenção.","forwardSteps":0,"backwardSteps":1},
  {"description":"Aceitaste um resultado inferior ao esperado sem te rebaixares? A autoestima não depende da nota.","forwardSteps":1,"backwardSteps":0},
  {"description":"Riste quando alguém errou na aula, em vez de apoiar? O respeito começa na empatia.","forwardSteps":0,"backwardSteps":1},
  {"description":"Desvalorizaste “menos disciplinas importantes”? Tudo o que aprendes tem um lugar no teu futuro.","forwardSteps":0,"backwardSteps":1},
  {"description":"Estiveste presente e atento durante todas as aulas da semana? A presença real é o primeiro passo.","forwardSteps":1,"backwardSteps":0},
  {"description":"Estudaste com intenção de compreender, não só de decorar? A compreensão sustenta o saber.","forwardSteps":1,"backwardSteps":0},
  {"description":"Aceitaste críticas construtivas sem te ofenderes? Crescer é escutar com abertura.","forwardSteps":1,"backwardSteps":0},
  {"description":"Zangaste-te com um professor em vez de procurar diálogo? O conflito sem escuta bloqueia a solução.","forwardSteps":0,"backwardSteps":1},
  {"description":"Esqueceste-te de entregar um trabalho por má gestão de tempo? A organização começa no hábito.","forwardSteps":0,"backwardSteps":1},
  {"description":"Mentiste sobre um trabalho que não fizeste? A verdade constrói confiança.","forwardSteps":0,"backwardSteps":1},
  {"description":"Fizeste uma autoavaliação sincera após um período letivo? Conhecer-te melhora os teus resultados.","forwardSteps":1,"backwardSteps":0}
]

