[
  {"description": "Se vives numa zona rural ou numa área mais afastada e tens dificuldades em aceder a serviços públicos como saúde, transporte ou até a uma boa escola, recua uma casa; se vives numa cidade ou numa área central com fácil \nacesso a serviços, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se na tua área não tens uma boa conexão à internet, o que dificulta o acesso a estudos online, pesquisas e comunicação, recua uma casa; se tens acesso a uma internet rápida e estável, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se na tua área não há serviços de apoio à saúde mental ou eles são difíceis de aceder, recua uma casa; se tens acesso a clínicas ou serviços de apoio à saúde mental na tua zona, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se a biblioteca ou centro cultural mais próximo de tua casa está distante ou mal equipado, recua uma casa; se tens fácil acesso a centros culturais e bibliotecas bem equipadas, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se as atividades culturais e educativas na tua cidade ou região são escassas ou muito distantes, recua uma casa; se vives numa área com muitas oportunidades culturais e educativas, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se tens universidades e escolas próximas, avança uma casa; se tiveste de mudar de cidade para continuar os estudos, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se precisas de viajar longas distâncias ou usar transportes públicos demorados para chegar à escola, recua uma casa; se vives perto da escola e não tens problemas de deslocação, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se vives numa área periférica onde a qualidade do ensino é considerada inferior, recua uma casa; se vives numa área central onde as escolas têm boa qualidade de ensino, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se vives numa zona com muitas oportunidades de emprego, avança uma casa; se tens de considerar mudar-te para encontrar trabalho, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se vives numa área costeira e podes facilmente ir à praia, avança uma casa; se tens de viajar bastante para aceder a zonas balneares, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se a tua região recebe investimento público em infraestruturas e serviços, avança uma casa; se sentes que a tua localidade é esquecida pelo governo, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se a tua região investe em energias renováveis e práticas sustentáveis, avança uma casa; se vives numa área com elevados níveis de poluição, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se a tua região tem medidas de prevenção contra incêndios e desastres naturais, avança uma casa; se já foste afetado(a) por incêndios ou cheias, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se tens acesso a mercados e supermercados perto de casa, avança uma casa; se tens de percorrer longas distâncias para fazer compras básicas, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se vives numa localidade com uma forte identidade cultural e festas regionais, avança uma casa; se há pouca oferta de eventos comunitários, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se o custo de vida na tua zona te permite viver confortavelmente, avança uma casa; se os preços da habitação são demasiado altos para a média salarial, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se a tua região tem transportes ferroviários modernos e eficazes, avança uma casa; se dependes apenas de autocarros de longo curso ou transportes escassos, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se tens ciclovias e condições para andar de bicicleta em segurança, avança uma casa; se andar de bicicleta é perigoso na tua zona devido à falta de infraestrutura, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se és responsável pela maior parte das tarefas domésticas, recua uma casa, se não fores, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se já te colocaram automaticamente num desporto por causa do teu género, recua uma casa, se não for o caso, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se já te disseram que \"meninas devem ser calmas e educadas\" ou \"meninos não podem chorar\", recua uma casa, se não for o caso, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se já te disseram para seres “mais delicado(a)” ou “menos agressivo(a)” por causa do teu género, recua uma casa, se não for o caso, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se notas que há mais tolerância para certos comportamentos dependendo do género do aluno, recua uma casa, se não for o caso, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se já ouviste comentários como \"os rapazes são mesmo assim\" para justificar comportamentos errados, recua uma casa, se não for o caso, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se já ouviste que algumas profissões ou disciplinas \"não são para o teu género\", recua uma casa, se não for o caso, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se já te perguntaram mais sobre casamento e filhos do que sobre carreira e sonhos, recua uma casa, se não for o caso, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se quando falas sobre casos de violência de género à tua volta, as pessoas levam a sério e apoiam as vítimas, avança duas casas; se dizem que é exagero ou \"problema entre o casal\", recua uma casa.","forwardSteps": 2,"backwardSteps": 1
  },
  {"description": "Se podes expressar as tuas emoções sem seres ridicularizado por isso, avança uma casa; se te dizem que \"os homens não choram\" ou que \"as mulheres dramatizam\", recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se quando viajas sozinho nunca sentiste necessidade de fingir que estás ao telefone para te sentires mais seguro, avança uma casa; se já o fizeste, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se já sentiste medo de não responder imediatamente a uma mensagem porque o teu namorado/a poderia ficar irritado/a, recua duas casas; se podes responder no teu tempo sem pressões ou cobranças, avança uma casa.","forwardSteps": 1,"backwardSteps": 2
  },
  {"description": "Se podes andar na rua sem medo de ouvir comentários ofensivos ou assédio, avança uma casa; se já te sentiste inseguro ou foste abordado de forma agressiva, recua duas casas.","forwardSteps": 1,"backwardSteps": 2
  },
  {"description": "Se, enquanto rapaz, já te disseram que não podias ser vítima de violência no namoro porque \"os homens é que são violentos\", recua uma casa; se reconheces que qualquer pessoa pode ser vítima e que há ajuda disponível, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se o teu namorado/a verifica constantemente com quem falas ou reage mal quando vê que interages com outras pessoas nas redes sociais, recua uma casa; se há respeito pela tua liberdade de comunicação, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se na tua cidade existem transportes públicos seguros e bem iluminados à noite, avança uma casa; se evitas certos percursos ou transportes por medo, recua uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se o teu namorado/a já exigiu saber a tua palavra-passe do telemóvel ou redes sociais \"para confiar em ti\", recua uma casa; se a tua privacidade é respeitada e a confiança é mútua, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se a tua namorada/o te liga ou manda mensagens excessivamente para saber onde estás e com quem, recua uma casa; se há confiança e liberdade para cada um ter o seu espaço, avança uma casa.","forwardSteps": 1,"backwardSteps": 1
  },
  {"description": "Se pertences a uma etnia discriminada, recua duas casas, se não pertenceres, avança duas casas.", "forwardSteps": 2, "backwardSteps": 2},
  {"description": "Se já te perguntaram \"mas de onde és mesmo?\" mesmo depois de dizeres que nasceste em Portugal, recua uma casa; se nunca questionaram a tua identidade portuguesa, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já te sentiste excluído(a) de atividades de grupo ou brincadeiras devido à tua etnia, recua uma casa; se sempre foste incluído(a) sem discriminação, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se raramente vês pessoas da tua etnia nos exemplos e imagens dos livros escolares, recua uma casa; se sempre vês a tua etnia bem representada, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já ouviste piadas sobre a tua etnia na escola e te disseram que estavas a exagerar ao sentires-te incomodado(a), recua duas casas; se nunca foste alvo desse tipo de piada, avança uma casa.", "forwardSteps": 1, "backwardSteps": 2},
  {"description": "Se já te sentiste excluído(a) de atividades de grupo ou brincadeiras devido à tua etnia, recua uma casa; se sempre foste incluído(a) sem discriminação, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já gozaram contigo ou corrigiram a tua forma de falar por causa do teu sotaque ou dialeto, recua uma casa; se nunca comentaram negativamente a forma como falas, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se sentes que a escola ensina pouco sobre a história e cultura da tua etnia, recua uma casa; se achas que a tua história e cultura são valorizadas nos conteúdos escolares, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se raramente vês artistas, escritores ou outras figuras públicas da tua etnia nas aulas de História ou Literatura, recua uma casa; se há uma boa representação da tua etnia nesses conteúdos, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já foste alvo de gozos ou bullying por causa da tua etnia e os professores não tomaram medidas eficazes, recua duas casas; se nunca passaste por isso ou se a escola reage rapidamente a essas situações, avança uma casa.", "forwardSteps": 1, "backwardSteps": 2},
  {"description": "Se na tua comunidade a polícia é vista como uma força de proteção e age de forma justa, avança uma casa; se há relatos de abusos policiais e desigualdade no tratamento de certas pessoas, recua uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se nunca ouviste piadas ou comentários depreciativos sobre a tua cultura na escola ou no trabalho, avança uma casa; se já foste alvo desse tipo de \"brincadeira\", recua uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já te disseram que \"as pessoas da tua etnia costumam ser assim ou assado\", recua uma casa; se nunca ouviste esse tipo de estereótipo, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se nunca te pediram documentos de identidade sem motivo aparente apenas por causa da tua aparência, avança uma casa; se já passaste por esse tipo de situação, recua uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se nunca ouviste alguém dizer que pessoas da tua etnia \"não são verdadeiramente portuguesas\", avança uma casa; se já te questionaram sobre a tua nacionalidade mesmo sendo português(a), recua uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se quando entras num espaço público, como um centro comercial ou um aeroporto, nunca foste seguido por seguranças sem motivo, avança uma casa; se já foste vigiado ou tratado com desconfiança por causa da tua aparência, recua uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se a tua família teve as mesmas facilidades para arrendar ou comprar casa como qualquer outra, avança uma casa; se já ouviram recusas implícitas ou diretas devido à etnia, recua uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se nunca ouviste expressões como \"volta para a tua terra\" dirigidas a ti ou à tua família, avança uma casa; se já foste alvo desse tipo de comentário, recua uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se a tua família tem dificuldades económicas, recua três casas, se não tem, avança três casas.", "forwardSteps": 3, "backwardSteps": 3},
  {"description": "Se já tiveste que levar o teu próprio almoço porque não podias pagar a cantina escolar, recua uma casa; se nunca precisaste de te preocupar com a alimentação escolar, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já sentiste que os teus colegas de classe tinham mais possibilidades financeiras do que tu, o que te fez sentir desconfortável, recua uma casa; se nunca sentiste essa diferença entre ti e os teus colegas, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se não tens dinheiro para comprar o material escolar recomendado, como cadernos ou equipamentos de qualidade, recua uma casa; se tens acesso ao material escolar necessário sem dificuldades financeiras, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se não pudeste participar em viagens de estudo ou excursões devido ao custo, recua uma casa; se sempre pudeste ir a essas viagens sem dificuldades financeiras, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se não tiveste acesso a apoio educacional extra, como explicações ou aulas particulares, devido à falta de recursos, recua uma casa; se tens acesso a esses apoios quando necessário, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já foste excluído(a) de atividades extracurriculares devido ao custo, recua uma casa; se participas em todas as atividades sem dificuldades financeiras, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já sentiste vergonha de não teres roupas novas ou da moda, recua uma casa; se tens roupa adequada e de acordo com as tendências, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já sentiste que as férias de verão dos teus colegas eram mais luxuosas do que as tuas, recua uma casa; se as tuas férias sempre foram semelhantes às dos teus colegas, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já sentiste que o teu bairro ou comunidade é menos valorizado pela escola, recua uma casa; se sentes que a tua comunidade tem o mesmo reconhecimento que as outras, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já foste incentivado a escolher um curso profissional em vez do ensino regular por causa da tua condição económica, recua uma casa; se sempre te disseram para seguires o que queres sem mencionarem questões financeiras, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já evitaste levar amigos a tua casa por teres vergonha das condições em que vives, recua duas casas; se sempre recebeste visitas sem preocupações, avança uma casa.", "forwardSteps": 1, "backwardSteps": 2},
  {"description": "Se nunca tiveste acesso a atividades culturais, como cinema, teatro ou museus, por não teres dinheiro para pagar, recua uma casa; se participas frequentemente em atividades culturais, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já foste tratado com menos respeito num restaurante ou loja por pareceres ter menos dinheiro, recua uma casa; se nunca sentiste diferença no tratamento por causa da tua aparência económica, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já te sentiste deslocado numa festa de aniversário porque não podias oferecer um presente tão bom como os outros, recua uma casa; se nunca te preocupaste com o preço dos presentes, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se não tens um computador em casa, recua uma casa; se tens um computador em casa que te permite fazer os teus trabalhos sem problemas, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},
  {"description": "Se já passaste frio em casa no inverno porque não podiam ligar o aquecimento, recua duas casas; se nunca te preocupaste com o custo do aquecimento, avança uma casa.", "forwardSteps": 1, "backwardSteps": 2},
  {"description": "Se já sentiste que os teus professores ou colegas tinham expetativas mais baixas sobre ti por vires de um bairro ou escola menos privilegiada, recua duas casas; se nunca sentiste que te julgavam pelo contexto socioeconómico, avança uma casa.", "forwardSteps": 1, "backwardSteps": 2},
  {  "description": "Se a tua escola não tem os recursos necessários, como bons professores, materiais didáticos ou infraestruturas adequadas, recua uma casa; se a tua escola oferece bons recursos e infraestruturas, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1},{  "description": "Se na tua escola faltam computadores ou outras tecnologias essenciais para a tua aprendizagem, recua uma casa; se tens acesso a computadores e tecnologias modernas que ajudam na aprendizagem, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola não oferece apoio psicológico ou tem um número limitado de psicólogos, recua uma casa; se tens acesso fácil a psicólogos escolares quando necessário, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola tem um ensino de baixo nível comparado com outras da região, recua uma casa; se a tua escola tem um ensino de boa qualidade e acompanhamento, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se tens um horário escolar inflexível e poucas oportunidades de participar em atividades extracurriculares, recua uma casa; se tens horários que permitem equilíbrio com atividades extracurriculares, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola não aborda questões de diversidade e inclusão, como igualdade de género, etnia ou orientação sexual, recua uma casa; se a tua escola promove essas questões e tem um ambiente inclusivo, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se não tens acesso a aulas de apoio ou reforço devido a limitações financeiras ou de recursos da tua escola, recua uma casa; se tens fácil acesso a esses apoios, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola não oferece programas de intercâmbio ou mobilidade para estudar em outros países, recua uma casa; se tens acesso a esses programas, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se não tens acesso a ensino especializado para necessidades educativas específicas ou dificuldades de aprendizagem, recua uma casa; se tens apoio especializado quando necessário, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola não envolve os pais ou tem poucas oportunidades para a participação deles, recua uma casa; se a escola promove o envolvimento dos pais em reuniões e atividades, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se tiveste de estudar num espaço com muito barulho ou distrações por não teres um local adequado para isso, recua uma casa; se sempre tiveste um espaço calmo para estudar, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se nunca tiveste de te preocupar com os custos da educação porque tiveste apoios ou boas condições, avança uma casa; se tiveste de abdicar de algo para continuar a estudar, recua uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola não oferece programas de preparação para o mercado de trabalho, como estágios ou orientação profissional, recua uma casa; se a escola prepara os alunos com estágios e aconselhamento de carreira, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se alguma vez faltaste à escola para ajudar a tua família em casa ou no trabalho, recua uma casa; se nunca tiveste essa responsabilidade, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se já foste discriminado na escola por causa da tua origem ou estatuto socioeconómico, recua duas casas; se sempre te trataram da mesma forma que os outros, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 2
},{  "description": "Se alguma vez te sentiste perdido nas aulas porque não tinhas explicações ou apoio extra, recua uma casa; se sempre tiveste acesso a explicações ou ajuda quando precisaste, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se alguma vez te disseram para escolheres um curso \"mais fácil\" porque \"não tens dinheiro para estudar muito tempo\", recua uma casa; se sempre pudeste escolher sem essa preocupação, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se alguma vez tiveste vergonha de comer na cantina porque usavas o apoio social para refeições, recua uma casa; se nunca te sentiste desconfortável com isso, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se tens dificuldades em aceder a cuidados médicos de rotina, como consultas de família ou exames básicos, recua uma casa; se tens acesso fácil a cuidados médicos regulares, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se tens dificuldades em obter medicamentos necessários devido ao custo ou falta de prescrição, recua uma casa; se tens acesso aos medicamentos necessários sem problemas financeiros, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se não tens acesso a alimentos saudáveis ou a aconselhamento nutricional, recua uma casa; se tens acesso a alimentos saudáveis e aconselhamento adequado, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se não tens acesso a apoio psicológico devido à falta de serviços ou por questões financeiras, recua uma casa; se tens acesso fácil a apoio psicológico quando necessário, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se vives numa área onde o atendimento de urgência está distante ou é insuficiente, recua uma casa; se tens acesso rápido a serviços de urgência de boa qualidade, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se não tens acesso a serviços de saúde sexual e reprodutiva adequados ou a educação sexual na escola, recua uma casa; se a escola oferece serviços e programas educativos adequados, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se não tens acesso a cuidados preventivos, como vacinas ou exames de rastreio, recua uma casa; se tens acesso a esses cuidados regularmente, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se não tens acesso a cuidados dentários regulares, como consultas ou tratamentos preventivos, recua uma casa; se tens acesso a cuidados dentários adequados, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola ou comunidade não oferece apoio adequado para alunos com deficiência física ou mental, recua uma casa; se a escola ou comunidade oferece apoio especializado e infraestrutura para alunos com deficiência, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua família não tem dinheiro para consultas médicas ou tratamentos, recua uma casa; se a tua família tem acesso a cuidados médicos pagos ou gratuitos, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se na tua família ou círculo de amigos não se fala abertamente sobre saúde mental e tens medo de pedir ajuda, recua uma casa; se podes pedir ajuda sem medo de julgamento, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se, enquanto rapariga, já te disseram que devias \"obedecer\" ao teu namorado e não discordar dele, recua duas casas; se tens liberdade para ter a tua própria opinião, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 2
},{  "description": "Se a tua escola não oferece programas de bem‑estar ou atividades para promover a saúde física e emocional, recua uma casa; se a escola oferece atividades e programas para o bem‑estar dos alunos, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se o teu namorado/a já te pediu para cortar relações com amigos/as do sexo oposto por ciúmes, recua uma casa; se tens liberdade para manter as tuas amizades sem desconfiança, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se, enquanto rapaz, foste alvo de agressões físicas por parte da tua namorada e não levaram a sério por \"ela não te poder magoar a sério\", recua uma casa; se a violência é reconhecida e condenada independentemente do género, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se não tens acesso a cuidados médicos adequados após uma hospitalização, como fisioterapia ou acompanhamento médico, recua uma casa; se tens acesso fácil a cuidados pós‑hospitalares adequados, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se, enquanto rapaz, foste pressionado a tomar todas as decisões numa relação porque \"os homens é que mandam\", recua uma casa; se ambos tomam decisões em conjunto, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se, enquanto rapariga, sentiste medo de terminar uma relação porque temias que o parceiro \"fizesse alguma coisa\", recua três casas; se sentes que podes terminar uma relação sem medo, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 3
},{  "description": "Se a tua identidade de género não é reconhecida ou respeitada na escola, recua uma casa; se a tua identidade de género é respeitada e aceita sem discriminação, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua família não aceita ou tem dificuldades em compreender a tua orientação sexual, recua uma casa; se a tua família te apoia e aceita a tua orientação sexual, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se as pessoas na tua escola não respeitam o nome ou os pronomes com que te identificas, recua uma casa; se o teu nome e pronomes são respeitados, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se já foste vítima de assédio ou bullying relacionado com o teu género ou orientação sexual na escola, recua uma casa; se nunca enfrentaste esse tipo de situação, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola não promove atividades ou programas educativos sobre orientação sexual e identidade de género, recua uma casa; se a tua escola promove essas atividades e discussões, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola não oferece um ambiente seguro ou acolhedor para estudantes transgéneros, recua uma casa; se a escola oferece apoio e inclusão para estudantes transgéneros, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola não oferece materiais educativos sobre diversidade de género ou sexualidade, recua uma casa; se a tua escola oferece programas e recursos educativos sobre estes temas, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se a tua escola não discute os direitos das pessoas LGBTI+ ou ignora questões de igualdade de direitos, recua uma casa; se a tua escola promove o respeito pelos direitos das pessoas LGBTI+, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se já foste alvo de estigma ou discriminação na escola devido à tua orientação sexual, recua uma casa; se nunca foste alvo de discriminação ou estigma por causa da tua orientação sexual, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se não tens acesso a apoio psicológico especializado para questões de identidade de género ou orientação sexual na tua escola, recua uma casa; se a tua escola oferece apoio especializado, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se na tua escola há alunos que sofrem bullying por causa da sua orientação sexual ou identidade de género e ninguém faz nada, recua uma casa; se há apoio e proteção para estes alunos, avança duas casas.",  "forwardSteps": 2,  "backwardSteps": 1
},{  "description": "Se os teus professores e colegas respeitam o teu nome e pronomes, avança uma casa; se já foste chamado(a) intencionalmente por um nome ou pronome que não corresponde à tua identidade, recua duas casas.",  "forwardSteps": 1,  "backwardSteps": 2
},{  "description": "Se já experienciaste discriminação ou injustiça relacionada com a tua identidade de género na escola, recua uma casa; se nunca foste discriminado ou injustiçado por causa da tua identidade de género, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se podes andar de mão dada ou beijar o teu parceiro/a em público sem receio de olhares ou insultos, avança uma casa; se já foste alvo de preconceito ou comentários agressivos por demonstrares afeto, recua duas casas.",  "forwardSteps": 1,  "backwardSteps": 2
},{  "description": "Se já foste expulso/a de casa ou ameaçado/a de o ser por causa da tua orientação sexual ou identidade de género, recua uma casa; se tens uma família que te apoia incondicionalmente, avança duas casas.",  "forwardSteps": 2,  "backwardSteps": 1
},{  "description": "Se a tua escola não promove a visibilidade de figuras públicas ou temas LGBTI+, recua uma casa; se a tua escola promove a visibilidade de questões LGBTI+ de forma aberta e respeitosa, avança uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se tens acesso a casas de banho e balneários que respeitam a tua identidade de género, avança uma casa; se já te sentiste desconfortável ou impedido(a) de usar uma casa de banho por causa da tua identidade, recua uma casa.",  "forwardSteps": 1,  "backwardSteps": 1
},{  "description": "Se vives num ambiente onde podes falar abertamente sobre os teus sentimentos e relações sem medo de discriminação, avança uma casa; se já foste aconselhado(a) a \"mudar\" ou \"esconder\" quem és, recua duas casas.",  "forwardSteps": 1,  "backwardSteps": 2
},{"description": "Se a tua escola não respeita ou impede a expressão religiosa de alunos, recua uma casa; se a tua escola respeita e permite a expressão religiosa de maneira inclusiva, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua escola não oferece um espaço ou tempo para a prática religiosa, recua uma casa; se a tua escola permite que os alunos pratiquem livremente a sua religião, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua escola tem preconceitos ou desconhecimento em relação a religiões menos comuns, recua uma casa; se a tua escola promove a aceitação e o conhecimento de todas as religiões, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já foste vítima de discriminação devido à tua religião na escola, recua uma casa; se nunca foste alvo de discriminação religiosa, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se na tua escola o ensino religioso não é respeitado como uma matéria de escolha ou é imposto de maneira desigual, recua uma casa; se na tua escola o ensino religioso é oferecido de forma opcional e respeitosa, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se não existem representantes da tua religião na escola para te apoiar ou orientar, recua uma casa; se a tua escola tem representantes ou grupos de apoio para diferentes religiões, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua família não aceita ou tem dificuldades em aceitar a tua religião, recua uma casa; se a tua família respeita e apoia a tua escolha religiosa, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua escola não reconhece ou desconsidera festivais religiosos importantes para a tua fé, recua uma casa; se a tua escola reconhece e respeita os festivais religiosos de todos os alunos, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua escola não oferece oportunidades para aprender ou discutir sobre outras religiões de maneira inclusiva, recua uma casa; se a tua escola oferece oportunidades para conhecer e debater religiões diversas, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua escola não oferece opções alimentares que respeitem as tuas restrições religiosas, recua uma casa; se a tua escola oferece refeições que respeitam as restrições alimentares religiosas, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já gozaram contigo ou te fizeram sentir mal por usares símbolos religiosos (como lenço, cruz ou quipá), recua uma casa; se nunca foste julgado pela tua aparência religiosa, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se foste impedido de faltar à escola ou ao trabalho para celebrar feriados religiosos importantes para ti, recua uma casa; se sempre respeitaram essas datas, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua religião é ridicularizada ou desrespeitada na escola, recua uma casa; se a tua religião é respeitada e valorizada na comunidade escolar, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se alguma vez te fizeram perguntas insistentes ou desconfortáveis sobre a tua religião, recua uma casa; se nunca tiveste de justificar as tuas crenças, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se alguma vez foste alvo de preconceito por seres ateu ou agnóstico, recua uma casa; se nunca te discriminaram por não teres uma religião, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se na tua escola a diversidade religiosa é mal vista ou mal compreendida, recua uma casa; se a tua escola respeita e promove a diversidade religiosa entre os alunos, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já sentiste medo de revelar a tua religião por receio de discriminação, recua duas casas; se nunca tiveste de esconder a tua fé, avança uma casa.", "forwardSteps": 1, "backwardSteps": 2},{"description": "Se já te obrigaram a participar em cerimónias religiosas com as quais não concordavas, recua uma casa; se sempre respeitaram a tua liberdade de crença, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já foste alvo de comentários ou discriminação devido ao teu peso corporal, recua uma casa; se nunca foste alvo de estigma relacionado com o peso, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua escola promove ou impõe padrões de beleza muito rígidos ou estereotipados, recua uma casa; se a tua escola respeita a diversidade de padrões de beleza, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já foste alvo de críticas ou bullying devido ao teu tipo de cabelo (liso, encaracolado, etc.), recua uma casa; se nunca foste alvo de estigma por causa do teu tipo de cabelo, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua escola não promove a aceitação de diferentes tipos de corpo, recua uma casa; se a tua escola promove a aceitação de todos os tipos de corpo, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se na tua escola é valorizado o uso de maquilhagem ou produtos para alterar a aparência natural, recua uma casa; se a tua escola valoriza a beleza natural sem necessidade de modificações, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já foste criticado por não seguir normas de vestuário ou estilos de roupa populares, recua uma casa; se nunca foste criticado pela tua forma de vestir, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já foste vítima de discriminação devido à tua aparência facial, recua uma casa; se nunca foste discriminado por causa da tua aparência facial, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já foste alvo de comentários negativos sobre acne ou problemas de pele, recua uma casa; se nunca foste alvo de comentários sobre isso, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se a tua escola não oferece oportunidades para aprender ou discutir sobre diferentes religiões e culturas de maneira inclusiva, recua uma casa; se a tua escola oferece oportunidades para conhecer e debater religiões e culturas diversas, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se foste discriminado pela tua aparência ou por não seguires estereótipos de género, recua uma casa; se a tua aparência não é julgada com base em estereótipos de género, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se foste alvo de discriminação ou comentários sobre a aparência dos teus pais, recua uma casa; se nunca foste alvo de comentários sobre isso, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se foste tratado/a de maneira diferente por ter acne, estrias ou marcas visíveis na pele, recua uma casa; se nunca te sentiste discriminado por isso, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se na tua escola existe um ambiente de julgamento constante sobre a aparência dos alunos, recua uma casa; se a tua escola promove a diversidade e o respeito por diferentes aparências, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se as tuas queixas ou problemas não são levados a sério por professores, médicos ou autoridades por seres jovem, mulher ou pertenceres a uma minoria, recua uma casa; se as tuas queixas são ouvidas e levadas a sério, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já te disseram que tinhas de mudar de visual para seres levado/a a sério, recua uma casa; se nunca te pressionaram a mudar a tua aparência para isso, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se há expectativas na tua escola sobre como a tua aparência deve mudar com a idade, recua uma casa; se a tua escola não impõe expectativas para a tua aparência relacionada à idade, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se nunca recebeste mensagens ofensivas ou ameaçadoras online, avança uma casa; se já foste alvo de ódio ou ameaças nas redes sociais, recua uma casa.", "forwardSteps": 1, "backwardSteps": 1},{"description": "Se já te disseram para emagrecer ou engordar para seres mais atraente, recua uma casa; se nunca te fizeram esse tipo de comentário, avança uma casa.", "forwardSteps": 1, "backwardSteps": 1}
]

