[
  {"description":"Se tens acesso ao Serviço Nacional de Saúde (SNS), que garante cuidados médicos a todos os cidadãos, incluindo consultas e tratamentos, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, o Programa de Acolhimento de Refugiados permite a integração de refugiados com apoios financeiros e acesso a serviços de saúde, educação e emprego, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, a Licença Parental permite aos pais tirar tempo de licença após o nascimento de um filho, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se vives num país onde a Lei da Identidade de Género (Lei n.º 38/2018) permite que as pessoas transgénero alterem o seu nome e género no registo civil sem requisitos médicos, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se tens acesso a medicamentos essenciais a preços reduzidos através da Comparticipação de Medicamentos, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal todos os cidadãos, independentemente da sua orientação sexual ou identidade de género, têm o direito ao voto nas eleições, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se tens conhecimento que casais do mesmo sexo em Portugal têm o direito de adotar filhos (desde a legalização do casamento entre pessoas do mesmo sexo em 2010), avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se tens acesso a serviços de apoio psicológico através do Programa Nacional de Saúde Mental, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se existe o acesso ao Rendimento Social de Inserção, um apoio financeiro destinado a apoiar famílias em situação de vulnerabilidade económica, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso à Educação Gratuita e Universal, desde a educação infantil até ao ensino superior, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal a Lei n.º 46/2006 combate a discriminação contra pessoas com deficiência, garantindo direitos como acessibilidade e igualdade de oportunidades, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso a habitação pública ou apoio ao arrendamento para famílias de baixos rendimentos, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso ao Programa Nacional de Vacinação, que oferece vacinas gratuitas contra doenças como a gripe, sarampo e COVID-19, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso a espaços públicos acessíveis a pessoas com deficiência, como rampas e elevadores, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso a apoios financeiros ou serviços para cuidadores informais, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso a centros de apoio às vítimas de violência doméstica, como a Rede Nacional de Apoio a Vítimas de Violência Doméstica, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal as políticas de anti-discriminação no local de trabalho protegem as pessoas LGBTIQA+ e garantem a igualdade de oportunidades, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens direito a pensões de reforma e apoio à aposentadoria, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal existe uma Lei Contra a Discriminação Racial (Lei n.º 93/2017) que protege contra a discriminação com base na etnia, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal a Lei n.º 46/2006 combate a discriminação contra pessoas com deficiência, garantindo direitos como acessibilidade e igualdade de oportunidades, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso a serviços de saúde e educação na tua localidade, mesmo que viva em zonas rurais, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens a possibilidade de aceder a bolsas de estudo para apoiar o pagamento da tua educação superior, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso ao apoio judiciário gratuito, quando não tens condições financeiras, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso a programas de apoio à mobilidade, como subsídios para transporte público para estudantes e idosos, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso a residências universitárias ou apoios ao arrendamento, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal tens acesso a transportes públicos acessíveis, como autocarros, metro e comboios, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal existem programas escolares que combatem o bullying por aparência física, como campanhas de sensibilização e apoio a vítimas, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal algumas marcas promovem padrões de beleza mais diversos e inclusivos, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal os manuais escolares são fornecidos gratuitamente até ao 12º ano, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, os idosos com rendimento baixo têm acesso gratuito ou com grande desconto a medicamentos essenciais, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal as escolas oferecem acesso gratuito à tecnologia, como computadores e Internet, para garantir a inclusão digital, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, as crianças de famílias carenciadas têm acesso gratuito a refeições escolares durante o período letivo, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, as consultas médicas no Serviço Nacional de Saúde (SNS) são gratuitas para quem tem rendimento baixo, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal as escolas devem garantir acessibilidade física e curricular a alunos com deficiência, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, os estudantes de ensino superior com dificuldades económicas podem solicitar bolsas de estudo para pagar propinas e despesas escolares, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, as pessoas desempregadas podem beneficiar de subsídios de desemprego que garantem uma fonte de rendimento enquanto procuram novo emprego, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, os imigrantes têm acesso a programas de integração, que incluem apoio à aprendizagem da língua portuguesa e à procura de emprego, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, pessoas em situação de vulnerabilidade estão isentas de taxas moderadoras no SNS, garantindo acesso a cuidados de saúde, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal o Decreto‑Lei n.º 54/2018 estabelece medidas de educação inclusiva para alunos com necessidades especiais, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal existem programas para apoiar pessoas em situação de sem‑abrigo, oferecendo‑lhes acesso a alimentos, cuidados de saúde e alojamento, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal há apoios para alimentação, transporte e material escolar para alunos de famílias com baixos rendimentos, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal o salário mínimo é atualizado anualmente por legislação específica, como o Decreto‑Lei n.º 107/2023, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal, os jovens empreendedores de regiões rurais podem aceder a subvenções e financiamento para iniciar negócios, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal o Programa Escola Digital distribuiu computadores e tablets gratuitos a alunos do ensino público (Resolução do Conselho de Ministros n.º 30/2020), avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal o Programa Porta 65 Jovem apoia jovens no pagamento da renda, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal a Tarifa Social de Energia (Decreto‑Lei n.º 100/2020) reduz os custos de eletricidade e gás para famílias carenciadas, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal a Agência Nacional de Inovação (ANI) financia startups tecnológicas e investigação científica, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal os museus nacionais oferecem entrada gratuita aos domingos e feriados para residentes, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal o Programa Nacional para as Alterações Climáticas promove a redução das emissões de gases com efeito de estufa, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal a Rede Nacional de Incubadoras apoia o crescimento de novas empresas, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal o Plano Ferrovia 2030 moderniza a rede ferroviária, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal existe um incentivo à compra de veículos elétricos e híbridos através do Fundo Ambiental, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal a Polícia de Proximidade da PSP promove a relação entre cidadãos e agentes, reduzindo a criminalidade, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal a construção de autoestradas e vias rápidas em zonas do interior é financiada pelo Plano Nacional de Investimentos 2030, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal a Constituição garantiu direitos fundamentais como liberdade de expressão, reunião e associação, permitindo que qualquer cidadão expresse as suas opiniões sem medo de represálias, e hoje a democracia é sólida e protege as liberdades individuais, avancem três casas.","forwardSteps":3,"backwardSteps":0},
  {"description":"Se em Portugal a Agência Nacional de Inovação (ANI) financia startups tecnológicas e investigação científica, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal os museus nacionais oferecem entrada gratuita aos domingos e feriados para residentes, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal o Programa Nacional para as Alterações Climáticas promove a redução das emissões de gases com efeito de estufa, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal a Rede Nacional de Incubadoras apoia o crescimento de novas empresas, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal o Plano Ferrovia 2030 moderniza a rede ferroviária, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal existe um incentivo à compra de veículos elétricos e híbridos através do Fundo Ambiental, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal a Polícia de Proximidade da PSP promove a relação entre cidadãos e agentes, reduzindo a criminalidade, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal a construção de autoestradas e vias rápidas em zonas do interior é financiada pelo Plano Nacional de Investimentos 2030, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal o complemento solidário para idosos (Decreto‑Lei n.º 232/2005) foi criado para apoiar pensionistas com baixos rendimentos, garantindo uma velhice mais digna a milhares de portugueses, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal os escalões do IRS foram ajustados nos últimos anos para reduzir a carga fiscal das famílias de rendimentos mais baixos, isso permitiu um aumento do rendimento disponível para essas pessoas, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal as creches passaram a ser gratuitas para crianças até aos três anos (Plano de Expansão da Rede de Creches, 2022), isso permitiu que mais famílias conseguissem equilibrar a vida profissional e pessoal, avancem três casas.","forwardSteps":3,"backwardSteps":0},
  {"description":"Se em Portugal os contratos coletivos de trabalho foram reforçados para garantir melhores condições salariais e laborais, isso ajudou a combater a precariedade no emprego, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal o Programa Porta 65 Jovem apoia o arrendamento por parte de jovens até aos 35 anos, isso ajuda a reduzir a dificuldade de acesso à habitação, avancem uma casa.","forwardSteps":1,"backwardSteps":0},
  {"description":"Se em Portugal o salário mínimo nacional aumentou progressivamente desde 1974, garantindo melhores condições de vida para trabalhadores com menores rendimentos, isso ajudou a reduzir a pobreza, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal o imposto sobre rendimentos (IRS) tem taxas progressivas, significando que quem ganha mais contribui proporcionalmente mais, isso promove uma distribuição mais justa da riqueza, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal a Linha Nacional de Emergência para Vítimas de Violência Doméstica (800 202 148) funciona 24h por dia para apoiar vítimas e encaminhá‑las para segurança, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal os bancos foram obrigados a disponibilizar contas bancárias com custos reduzidos (contas de serviços mínimos bancários), isso permitiu que mais pessoas acedessem ao sistema financeiro sem encargos excessivos, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal a taxa de analfabetismo caiu de 25% em 1974 para menos de 3% em 2024, avancem três casas.","forwardSteps":3,"backwardSteps":0},
  {"description":"Se em Portugal foi aprovada a Lei da Paridade, que obriga a uma maior representação de mulheres na política e em cargos de decisão, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal existe a Linha SNS 24 (808 24 24 24), que presta aconselhamento médico e encaminhamento para serviços de saúde, isso facilita o acesso a cuidados médicos, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal a energia renovável representa mais de 60% da eletricidade produzida, reduzindo a dependência de combustíveis fósseis, avancem três casas.","forwardSteps":3,"backwardSteps":0},
  {"description":"Se em Portugal a criminalização da violência doméstica como crime público reforçou a proteção das vítimas e facilitou as denúncias, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal a Linha de Apoio à Vítima da APAV (116 006) presta apoio gratuito e confidencial a vítimas de crimes e violência, isso ajuda quem precisa de proteção e justiça, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal a Estratégia Nacional para a Integração das Comunidades Ciganas promove medidas para combater a discriminação e melhorar a inclusão social, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal a lei garante acesso gratuito à interrupção voluntária da gravidez (aborto) seguro no SNS, protegendo a saúde das mulheres, avancem duas casas.","forwardSteps":2,"backwardSteps":0},
  {"description":"Se em Portugal a Linha SOS Voz Amiga dá apoio emocional e prevenção ao suicídio (213 544 545 / 912 802 669 / 963 524 660), avancem duas casas.","forwardSteps":2,"backwardSteps":0}
]